tutorials/compressible/nexaFoam/neTCLib/doubleCone/0/Y_N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Y_N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "initialConditions"

dimensions      [0 0 0 0 0 0 0];

internalField   uniform $N2_mass_fraction;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $N2_mass_fraction;
    }

    cone
    {
        type            zeroGradient;
    }

    wedge1
    {
        type            wedge;
    }

    wedge2
    {
        type            wedge;
    }

    outlet
    {
        type            zeroGradient;
    }

	symmBC
	{
		type			symmetry;
	}
}


// ************************************************************************* //
