tutorials/compressible/nexaFoam/neTCLib/doubleCone/0/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      initialConditions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

TTRValue  389;
TVibValue 389;
TwallValue  300;

pressureValue  110;

velocityValue  (4303 0 0);

N2_mass_fraction 0.765;
O2_mass_fraction 0.235;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
